app/views/users/show.json.jbuilder

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 14]]
---
json.events do
  json.array! @user.events.collect { |e| e.id }