app/views/event/order.json.jbuilder

SELECT "images".* FROM "images" WHERE "images"."event_id" = $1  [["event_id", 10]]
---
    json.images do
      json.array! event.images.collect { |img| img.image_url }