app/controllers/comment_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "event_id", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-08-15 20:17:16.050049"], ["updated_at", "2017-08-15 20:17:16.050049"], ["event_id", 43], ["description", "Optio voluptatem nobis dolor ducimus omnis nam et."]]
---
  def create
    @event = Event.find(params[:event_id])
    @comment = @event.comments.build(comment_params)
    if @comment.save