app/controllers/event_controller.rb

SELECT "events".* FROM "events" WHERE "events"."type" = $1  [["type", "Academic"]]
SELECT COUNT(*) FROM "events" WHERE "events"."type" = $1  [["type", "Academic"]]
---
  def index
    @events = Event.filter(params.slice(:type)).future_events.paginate(page: params[:page],
      per_page: 10)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:id])

INSERT INTO "events" ("created_at", "updated_at", "name", "description", "value", "contact", "date", "address", "type", "user_id", "lat", "long", "event_status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."type" IN ('Academic') AND "events"."id" = $1  [["id", 4]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "events" SET "date" = $1, "name" = $2, "description" = $3, "cover_data" = $4, "value_in_real" = $5, "address" = $6, "contact" = $7, "updated_at" = $8 WHERE "events"."id" = $9
---
  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(event_params)

SELECT  "events".* FROM "events" WHERE "events"."published" = $1 AND (date >= '2017-09-26') LIMIT $2 OFFSET $3  [["published", "t"], ["LIMIT", 10], ["OFFSET", 0]]
---
  def order
    @events = Event.ordered(ordering_params).published.future_events.paginate(page: params[:page],
      per_page: 10)